# **AI Diploma**

### **Data Science**

### Assignment 4 (DS)

<img src="https://th.bing.com/th/id/R.84611a9f16c2c2ebda65da14c5280e03?rik=YXFlHrjbBApRZQ&pid=ImgRaw&r=0" alt="alternatetext" style="width:1000px;">

In [2]:
import numpy as np
import pandas as pd

### 1) Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module.

In [26]:
arr1 = np.array ([['Ahmed',173,80,'01007536758'],
                 ['Ashraf',176,95,'01284990343']])
df = pd.DataFrame (arr1, columns = ['Name', 'Height','Weight','Mobile'])
type(df)

pandas.core.frame.DataFrame

### 2) Write a Pandas program to convert a Panda module Series to Python list and it's type.

In [33]:
df2 = list(df.loc[1])
print (df2)
type(df2)

['Ashraf', '176', '95', '01284990343']

list

### 3) Write a Pandas program to compare the elements of the two Pandas Series.

In [45]:
series1 = pd.Series([1, 2, 3, 4, 5])
series2 = pd.Series([5, 4, 3, 2, 1])

greater = series1>series2
print (greater)
less = series1<series2
print (less)
equal = series1==series2
print (equal)

0    False
1    False
2    False
3     True
4     True
dtype: bool
0     True
1     True
2    False
3    False
4    False
dtype: bool
0    False
1    False
2     True
3    False
4    False
dtype: bool

### 4) Write a Pandas program to change the data type of given a column or a Series.

In [48]:
series2 = pd.Series([5, 4, 3, 2, 1])
series3=list(series2)
print (type(series3))

<class 'list'>

### 5) Write a Pandas program to get the powers of an array values element-wise. Note: First array elements raised to powers from second array Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
Expected Output:
X Y Z 0 78 84 86 1 85 94 97 2 96 89 96 3 80 83 72 4 86 86 83

In [6]:
data= {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

f=lambda x : x*x

df = pd.DataFrame (data)
df=df.apply (f)
df

      X     Y     Z
0  6084  7056  7396
1  7225  8836  9409
2  9216  7921  9216
3  6400  6889  5184
4  7396  7396  6889

### 6) Write a Pandas program to get the first 3 rows of a given DataFrame. Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], 'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
First three rows of the data frame: attempts name qualify score a 1 Anastasia yes 12.5 b 3 Dima no 9.0 c 2 Katherine yes 1

Test Data:
0
Streat1
S001
V
Alberto
Franco
15/05/2002
35
1
Streat2
S002
V
Gino
Mcneill
17/05/2002
32
2
Streat3
S003
VI
Ryan
Parkes
16/02/1999
33
3
Streat4
S004
VI
Eesha
Hinton
25/09/1998
30
4
Streat5
S005
V
Gino
Mcneill
11/05/2002
31
5
Streat6
S006
VI
David
Parkes
15/09/1997
326.5

In [67]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame (exam_data , index = labels)

df = df.reindex(columns = ['attempts','score','name','qualify'])
df.head(3)

   attempts  score       name qualify
a         1   12.5  Anastasia     yes
b         3    9.0       Dima      no
c         2   16.5  Katherine     yes

### 7) Write a Pandas program to display the default index and set a column as an Index in a given dataframe.

In [28]:
data = {0:['Streat1','S001','V','Alberto','Franco','15/05/2002',35],
        1:['Streat2','S002','V','Gino','Mcneill','17/05/2002',32],
        2:['Streat3','S003','VI','Ryan','Parkes','16/02/1999',33],
        3:['Streat4','S004','VI','Eesha','Hinton','25/09/1998',30],
        4:['Streat5','S005','V','Gino','Mcneill','11/05/2002',31],
        5:['Streat6','S006','VI','David','Parkes','15/09/1997',32]}

df = pd.DataFrame (data)
df = df.transpose()
df.set_index (0,inplace = True)
df

            1   2        3        4           5   6
0
Streat1  S001   V  Alberto   Franco  15/05/2002  35
Streat2  S002   V     Gino  Mcneill  17/05/2002  32
Streat3  S003  VI     Ryan   Parkes  16/02/1999  33
Streat4  S004  VI    Eesha   Hinton  25/09/1998  30
Streat5  S005   V     Gino  Mcneill  11/05/2002  31
Streat6  S006  VI    David   Parkes  15/09/1997  32

### 8) Write a Pandas program to display the default index and set a column as an Index in a given dataframe and then reset the index

In [35]:
data = {0:['Streat1','S001','V','Alberto','Franco','15/05/2002',35],
        1:['Streat2','S002','V','Gino','Mcneill','17/05/2002',32],
        2:['Streat3','S003','VI','Ryan','Parkes','16/02/1999',33],
        3:['Streat4','S004','VI','Eesha','Hinton','25/09/1998',30],
        4:['Streat5','S005','V','Gino','Mcneill','11/05/2002',31],
        5:['Streat6','S006','VI','David','Parkes','15/09/1997',32]}

df = pd.DataFrame (data)
df = df.transpose()
print (f"Original Database is\n{df}")
df.set_index (0,inplace = True)
print (f"Edited Database is\n{df}")
df.reset_index (inplace = True)
print (f"Reset Database is\n{df}")

Original Database is
         0     1   2        3        4           5   6
0  Streat1  S001   V  Alberto   Franco  15/05/2002  35
1  Streat2  S002   V     Gino  Mcneill  17/05/2002  32
2  Streat3  S003  VI     Ryan   Parkes  16/02/1999  33
3  Streat4  S004  VI    Eesha   Hinton  25/09/1998  30
4  Streat5  S005   V     Gino  Mcneill  11/05/2002  31
5  Streat6  S006  VI    David   Parkes  15/09/1997  32
Edited Database is
            1   2        3        4           5   6
0
Streat1  S001   V  Alberto   Franco  15/05/2002  35
Streat2  S002   V     Gino  Mcneill  17/05/2002  32
Streat3  S003  VI     Ryan   Parkes  16/02/1999  33
Streat4  S004  VI    Eesha   Hinton  25/09/1998  30
Streat5  S005   V     Gino  Mcneill  11/05/2002  31
Streat6  S006  VI    David   Parkes  15/09/1997  32
Reset Database is
         0     1   2        3        4           5   6
0  Streat1  S001   V  Alberto   Franco  15/05/2002  35
1  Streat2  S002   V     Gino  Mcneill  17/05/2002  32
2  Streat3  S003  VI     Ryan   Parkes  16/02/1999  33
3  Streat4  S004  VI    Eesha   Hinton  25/09/1998  30
4  Streat5  S005   V     Gino  Mcneill  11/05/2002  31
5  Streat6  S006  VI    David   Parkes  15/09/1997  32

### 9) Write a Pandas program to create a dataframe indexing by date and time.

In [62]:
per = pd.date_range (start = '1-1-2020 07:00', freq = 'H', periods = 7)
df  = pd.DataFrame (data = ['Streat1','S001','V','Alberto','Franco','15/05/2002',35], index = per)
df

                              0
2020-01-01 07:00:00     Streat1
2020-01-01 08:00:00        S001
2020-01-01 09:00:00           V
2020-01-01 10:00:00     Alberto
2020-01-01 11:00:00      Franco
2020-01-01 12:00:00  15/05/2002
2020-01-01 13:00:00          35

### 10) Write a Pandas program to create a dataframe and set a title or name of the index column.

In [78]:
data = {0:['Streat1','S001','V','Alberto','Franco','15/05/2002',35],
        1:['Streat2','S002','V','Gino','Mcneill','17/05/2002',32],
        2:['Streat3','S003','VI','Ryan','Parkes','16/02/1999',33],
        3:['Streat4','S004','VI','Eesha','Hinton','25/09/1998',30],
        4:['Streat5','S005','V','Gino','Mcneill','11/05/2002',31],
        5:['Streat6','S006','VI','David','Parkes','15/09/1997',32]}


df = pd.DataFrame (data)
df = df.transpose()
df.index.name = 'Index_column'
df

                    0     1   2        3        4           5   6
Index_column
0             Streat1  S001   V  Alberto   Franco  15/05/2002  35
1             Streat2  S002   V     Gino  Mcneill  17/05/2002  32
2             Streat3  S003  VI     Ryan   Parkes  16/02/1999  33
3             Streat4  S004  VI    Eesha   Hinton  25/09/1998  30
4             Streat5  S005   V     Gino  Mcneill  11/05/2002  31
5             Streat6  S006  VI    David   Parkes  15/09/1997  32

### 11) Write a Pandas program to select a specific row of given series/dataframe by integer index.

In [79]:
df.iloc[0]
df.loc[1]

0       Streat2
1          S002
2             V
3          Gino
4       Mcneill
5    17/05/2002
6            32
Name: 1, dtype: object